
//#include "protocol_lib.c"

// ==========================================================================
// Вычисление контрольной суммы блока данных. (len < 256 !!!)

unsigned char Crc8(unsigned char *pcBlock, unsigned char len);

// ==========================================================================
// Вычисление контрольной суммы блока данных. (len < 256 !!!)

unsigned int CRC16(unsigned char * pcBlock, unsigned char len);
// ==========================================================================
// Функция для вычисления текущей контрольной суммы. (не забыть нач. 0xFFFF)

void CRC16_Byte(unsigned char byte, unsigned int *crc);

//